In [1]:
import pandas as pd

In [2]:
# Calculate the all 4 statistical moments for a given series using numpy.

In [46]:
import numpy as np

np.random.seed(42)

In [44]:
idx = np.arange(100)
values = np.random.randint(100, 500, 100)

In [45]:
values

array([256, 114, 400, 164, 444, 426, 108, 443, 228, 235, 162, 238, 180,
       491, 262, 388, 478, 360, 330, 140, 127, 234, 300, 427, 367, 132,
       147, 161, 315, 392, 198, 271, 459, 313, 134, 326, 200, 230, 356,
       104, 317, 354, 497, 458, 382, 492, 306, 114, 445, 141, 479, 278,
       162, 451, 330, 340, 151, 195, 487, 321, 330, 336, 242, 270, 128,
       135, 112, 259, 426, 286, 342, 185, 383, 165, 269, 144, 161, 233,
       383, 127, 207, 143, 439, 385, 430, 227, 447, 330, 289, 324, 484,
       476, 382, 220, 215, 332, 358, 458, 297, 236])

In [8]:
sr = pd.Series(data=values, index=idx)

In [60]:
def Moment(data):
    mu1 = np.sum(data) / len(data)
    mu2 = np.sum((data - mu1) ** 2) / len(data)
    mu3 = (np.sum((data - mu1) ** 3) / len(data)) / (np.sqrt(mu2) ** 3)
    mu4 = (np.sum((data - mu1) ** 4) / len(data)) / (mu2**2)
    return mu1, mu2, mu3, mu4

In [62]:
mean, variance, skewness, kurtosis = Moment(sr.values)

In [66]:
kurtosis

np.float64(1.8723132957183424)

In [67]:
import seaborn as sns
df = sns.load_dataset("titanic")

In [80]:
df = sns.load_dataset("titanic")

In [82]:
df.rename(columns={"survived": "Survive", "class": "Class"}, inplace=True)

In [83]:
df.head()

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [70]:
# Rename

In [71]:
# Columns

In [73]:
df.rename(columns={"class": "Class"}, inplace=True)

In [74]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [79]:
df = pd.DataFrame(sr).rename(columns={0: "Serial_Number"})

In [84]:
# Axis ->0
# Axis -> 1

In [89]:
num = df.select_dtypes(exclude=["object", "category", "bool"])

In [92]:
num

     Survive  pclass   age  sibsp  parch     fare
0          0       3  22.0      1      0   7.2500
1          1       1  38.0      1      0  71.2833
2          1       3  26.0      0      0   7.9250
3          1       1  35.0      1      0  53.1000
4          0       3  35.0      0      0   8.0500
..       ...     ...   ...    ...    ...      ...
886        0       2  27.0      0      0  13.0000
887        1       1  19.0      0      0  30.0000
888        0       3   NaN      1      2  23.4500
889        1       1  26.0      0      0  30.0000
890        0       3  32.0      0      0   7.7500

[891 rows x 6 columns]

In [ ]:
# 1 -> Column Wise operations
# Across the column
num.sum(axis=1)

0       33.2500
1      112.2833
2       37.9250
3       91.1000
4       46.0500
         ...
886     42.0000
887     51.0000
888     29.4500
889     58.0000
890     42.7500
Length: 891, dtype: float64

In [95]:
# 0 -> Row Wise
# Down the rows
num.sum(axis=0)

Survive      342.0000
pclass      2057.0000
age        21205.1700
sibsp        466.0000
parch        340.0000
fare       28693.9493
dtype: float64

In [98]:
num.mean(axis=0)

Survive     0.383838
pclass      2.308642
age        29.699118
sibsp       0.523008
parch       0.381594
fare       32.204208
dtype: float64

In [99]:
num.mean(axis=1)

0       5.541667
1      18.713883
2       6.320833
3      15.183333
4       7.675000
         ...
886     7.000000
887     8.500000
888     5.890000
889     9.666667
890     7.125000
Length: 891, dtype: float64

In [103]:
num["age"].median()

np.float64(28.0)

In [113]:
# 0.40 >=
num.corr()[num.corr() >= 0.40]

         Survive  pclass  age     sibsp     parch  fare
Survive      1.0     NaN  NaN       NaN       NaN   NaN
pclass       NaN     1.0  NaN       NaN       NaN   NaN
age          NaN     NaN  1.0       NaN       NaN   NaN
sibsp        NaN     NaN  NaN  1.000000  0.414838   NaN
parch        NaN     NaN  NaN  0.414838  1.000000   NaN
fare         NaN     NaN  NaN       NaN       NaN   1.0

In [114]:
df2 = sns.load_dataset("mpg")

In [115]:
df2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [118]:
df2.select_dtypes(exclude=["category", "object"]).corr()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
mpg,1.000000,-0.775396,-0.804203,-0.778427,-0.831741,0.420289,0.579267
cylinders,-0.775396,1.000000,0.950721,0.842983,0.896017,-0.505419,-0.348746
displacement,-0.804203,0.950721,1.000000,0.897257,0.932824,-0.543684,-0.370164
horsepower,-0.778427,0.842983,0.897257,1.000000,0.864538,-0.689196,-0.416361
weight,-0.831741,0.896017,0.932824,0.864538,1.000000,-0.417457,-0.306564
acceleration,0.420289,-0.505419,-0.543684,-0.689196,-0.417457,1.000000,0.288137
model_year,0.579267,-0.348746,-0.370164,-0.416361,-0.306564,0.288137,1.000000

In [120]:
df2.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

In [123]:
# iloc -> Searches using index postions
# loc -> Seaches using index labels

In [124]:
df.head()

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [127]:
df.iloc[0, 1:]

pclass                   3
sex                   male
age                   22.0
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
Class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False
Name: 0, dtype: object

In [129]:
df.iloc[2:, 2:]

,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
2,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [134]:
df.loc[121]

Survive                  0
pclass                   3
sex                   male
age                    NaN
sibsp                    0
parch                    0
fare                  8.05
embarked                 S
Class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 121, dtype: object

In [135]:
df.iloc[121, :]

Survive                  0
pclass                   3
sex                   male
age                    NaN
sibsp                    0
parch                    0
fare                  8.05
embarked                 S
Class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 121, dtype: object

In [138]:
df.index, values

(RangeIndex(start=0, stop=891, step=1),
 array([256, 114, 400, 164, 444, 426, 108, 443, 228, 235, 162, 238, 180,
        491, 262, 388, 478, 360, 330, 140, 127, 234, 300, 427, 367, 132,
        147, 161, 315, 392, 198, 271, 459, 313, 134, 326, 200, 230, 356,
        104, 317, 354, 497, 458, 382, 492, 306, 114, 445, 141, 479, 278,
        162, 451, 330, 340, 151, 195, 487, 321, 330, 336, 242, 270, 128,
        135, 112, 259, 426, 286, 342, 185, 383, 165, 269, 144, 161, 233,
        383, 127, 207, 143, 439, 385, 430, 227, 447, 330, 289, 324, 484,
        476, 382, 220, 215, 332, 358, 458, 297, 236]))

In [139]:
# 340

In [140]:
df.loc[340]

Survive                  1
pclass                   2
sex                   male
age                    2.0
sibsp                    1
parch                    1
fare                  26.0
embarked                 S
Class               Second
who                  child
adult_male           False
deck                     F
embark_town    Southampton
alive                  yes
alone                False
Name: 340, dtype: object

In [142]:
df.iloc[340, :]

Survive                  1
pclass                   2
sex                   male
age                    2.0
sibsp                    1
parch                    1
fare                  26.0
embarked                 S
Class               Second
who                  child
adult_male           False
deck                     F
embark_town    Southampton
alive                  yes
alone                False
Name: 340, dtype: object

In [144]:
df.loc[10:20]

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True

In [146]:
df.iloc[10:20, :]

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True

In [152]:
df.set_index("Class").loc["Third"]

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone
Class,,,,,,,,,,,,,,
Third,0,3,male,22.0,1,0,7.2500,S,man,True,NaN,Southampton,no,False
Third,1,3,female,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,yes,True
Third,0,3,male,35.0,0,0,8.0500,S,man,True,NaN,Southampton,no,True
Third,0,3,male,NaN,0,0,8.4583,Q,man,True,NaN,Queenstown,no,True
Third,0,3,male,2.0,3,1,21.0750,S,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Third,0,3,female,22.0,0,0,10.5167,S,woman,False,NaN,Southampton,no,True
Third,0,3,male,25.0,0,0,7.0500,S,man,True,NaN,Southampton,no,True
Third,0,3,female,39.0,0,5,29.1250,Q,woman,False,NaN,Queenstown,no,False
Third,0,3,female,NaN,1,2,23.4500,S,woman,False,NaN,Southampton,no,False
Third,0,3,male,32.0,0,0,7.7500,Q,man,True,NaN,Queenstown,no,True

In [157]:
df.set_index("Class").loc["Third"]

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone
Class,,,,,,,,,,,,,,
Third,0,3,male,22.0,1,0,7.2500,S,man,True,NaN,Southampton,no,False
Third,1,3,female,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,yes,True
Third,0,3,male,35.0,0,0,8.0500,S,man,True,NaN,Southampton,no,True
Third,0,3,male,NaN,0,0,8.4583,Q,man,True,NaN,Queenstown,no,True
Third,0,3,male,2.0,3,1,21.0750,S,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Third,0,3,female,22.0,0,0,10.5167,S,woman,False,NaN,Southampton,no,True
Third,0,3,male,25.0,0,0,7.0500,S,man,True,NaN,Southampton,no,True
Third,0,3,female,39.0,0,5,29.1250,Q,woman,False,NaN,Queenstown,no,False
Third,0,3,female,NaN,1,2,23.4500,S,woman,False,NaN,Southampton,no,False
Third,0,3,male,32.0,0,0,7.7500,Q,man,True,NaN,Queenstown,no,True

In [161]:
df.reset_index().set_index("sex")

,index,Survive,pclass,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,,
male,0,0,3,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
female,1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
female,2,1,3,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
female,3,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
male,4,0,3,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
male,886,0,2,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
female,887,1,1,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
female,888,0,3,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
male,889,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
male,890,0,3,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [163]:
df.shape

(891, 15)

In [169]:
df["Country"] = np.arange(df.shape[0])

In [171]:
df["Famil_size"] = df["sibsp"] + df["parch"] + 1

In [173]:
df.head()

,Survive,pclass,sex,age,sibsp,parch,fare,embarked,Class,who,adult_male,deck,embark_town,alive,alone,Country,Famil_size
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,2
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,3,2
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,4,1